src/cf/InformationRegisters/эв_НастройкиAPIИсточникаЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_НастройкиAPIИсточникаЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>auth_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>840</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>merchant</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресФТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогинФТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольФТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_КодыНоменклатурыПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_КодыНоменклатурыПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.эв_ВидыИсточниковЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>			<Dimension>
				<Properties>
					<Name>КодПортала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>

		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_ВыгруженныеОстаткиПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ВыгруженныеОстаткиПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЗаказыПокупателейССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыПокупателейССайта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЗаказаНаСайте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказаНаСайте</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.УдалитьОбменУправлениеНебольшойФирмойСайт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>эв_ОплаченНаПортале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>эв_ИсходныйПакет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КлючИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиИнтеграцийСИнтернетМагазином</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСИнтернетМагазином</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/эв_ВидыИсточниковЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>эв_ВидыИсточниковЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Асна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АптекуРу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МегаАптека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ютека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эвалар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АптекаМос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/эв_ОбменСПорталамиАсна/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка) Экспорт

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнены настройки API АСНА");
		Возврат Ложь;
	КонецЕсли;

	Если ПолнаяВыгрузка Или Не СвязкиЗаполнены() Тогда
		ЗагрузитьСвязки(Источник, НастройкиAPI);
	КонецЕсли;

	ТаблицаОстатков = ПолучитьОстаткиЦены(Источник, НастройкиAPI, ПолнаяВыгрузка);
	ТаблицаКОтправке = ТаблицаОстатков.СкопироватьКолонки();
	МассивОстатков = СформироватьМассивОстатков(ТаблицаОстатков, ТаблицаКОтправке);
	Если МассивОстатков.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("date", ДатаДляОстатков());
	ТелоЗапроса.Вставить("stocks", МассивОстатков);

	КодыУспеха = Новый Массив;
	КодыУспеха.Добавить(202);
	РезультатHTTP = ВыполнитьЗапросСТокеном(Источник, НастройкиAPI,
		?(ПолнаяВыгрузка, "POST", "PUT"),
		АдресРесурсаМагазина(НастройкиAPI, "/stocks"),
		ТелоЗапроса,
		?(ПолнаяВыгрузка, "stocksFull", "stocksInc"),
		КодыУспеха);

	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;

	эв_ОбменСПорталамиСервер.ОбновитьСнимокОстатков(Источник, ТаблицаКОтправке, ПолнаяВыгрузка);
	Возврат Истина;

КонецФункции

Функция ЗагрузитьЗаказы(Источник, НастройкиAPI) Экспорт

	ТаблицаЗагруженных = НоваяТаблицаЗагруженныхЗаказов();

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнены настройки API АСНА");
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	Если Не СвязкиЗаполнены() Тогда
		ЗагрузитьСвязки(Источник, НастройкиAPI);
	КонецЕсли;

	ДатаГраницы = эв_ОбменСПорталамиСервер.ДатаГраницыЗагрузкиЗаказов(Источник, "orders");
	АдресЗапроса = АдресРесурсаМагазина(НастройкиAPI, "/orders_exchanger?since=" + ДатаSince(ДатаГраницы));

	КодыУспеха = Новый Массив;
	КодыУспеха.Добавить(200);
	РезультатHTTP = ВыполнитьЗапросСТокеном(Источник, НастройкиAPI, "GET", АдресЗапроса, Неопределено, "orders", КодыУспеха);
	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	ЗагрузитьЗаказыИзJSON(Источник, НастройкиAPI, РезультатHTTP.Json, РезультатHTTP.ТекстОтвета, ТаблицаЗагруженных);
	Возврат ТаблицаЗагруженных;

КонецФункции

Функция ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI) Экспорт

	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Результат.ТекстОшибки = "Не заполнены настройки API АСНА";
		Возврат Результат;
	КонецЕсли;

	ИдентификаторЗаказа = эв_ОбменСПорталамиСервер.ИдентификаторЗаказаНаПортале(ПараметрыОчереди.ЗаказПокупателя);
	Если Не ЗначениеЗаполнено(ИдентификаторЗаказа) Тогда
		Результат.ТекстОшибки = "Не найден orderId заказа на портале";
		Возврат Результат;
	КонецЕсли;

	КодСтатуса = эв_ОбменСПорталамиСервер.КодСтатусаПортала(ПараметрыОчереди.ИсточникЗаказов, ПараметрыОчереди.СтатусЗаказа);
	Если Не ЗначениеЗаполнено(КодСтатуса) Тогда
		Результат.ТекстОшибки = "Не задан код статуса портала для состояния заказа";
		Возврат Результат;
	КонецЕсли;

	СтатусПортала = Новый Структура;
	СтатусПортала.Вставить("statusId", Строка(Новый УникальныйИдентификатор));
	СтатусПортала.Вставить("orderId", ИдентификаторЗаказа);
	СтатусПортала.Вставить("storeId", СокрЛП(НастройкиAPI.Логин));
	СтатусПортала.Вставить("date", ДатаJSONСоСмещением(ТекущаяДатаСеанса()));
	СтатусЧислом = ЧислоИзJSON(КодСтатуса);
	Если СтатусЧислом = 0 И СокрЛП(КодСтатуса) <> "0" Тогда
		Результат.ТекстОшибки = "Код статуса портала не является числом";
		Возврат Результат;
	КонецЕсли;

	СтатусПортала.Вставить("status", СтатусЧислом);
	СтатусПортала.Вставить("cmnt", "");

	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(СтатусПортала);

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("statuses", МассивСтатусов);

	СтрокиСборки = СтрокиЧастичнойСборки(ПараметрыОчереди.ЗаказПокупателя, ИдентификаторЗаказа);
	Если СтрокиСборки.Количество() > 0 Тогда
		ТелоЗапроса.Вставить("rows", СтрокиСборки);
	КонецЕсли;

	КодыУспеха = Новый Массив;
	КодыУспеха.Добавить(201);
	РезультатHTTP = ВыполнитьЗапросСТокеном(ПараметрыОчереди.ИсточникЗаказов, НастройкиAPI, "PUT",
		АдресРесурсаМагазина(НастройкиAPI, "/orders_exchanger"), ТелоЗапроса, "setStatus", КодыУспеха,
		ПараметрыОчереди.ЗаказПокупателя);

	Результат.Успех = РезультатHTTP.Успех;
	Результат.ТекстОшибки = РезультатHTTP.ТекстОшибки;
	Возврат Результат;

КонецФункции

Функция ДанныеПодключенияКорректны(НастройкиAPI) Экспорт

	Если ТипЗнч(НастройкиAPI) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ПолеЗаполнено(НастройкиAPI, "Адрес")
		И ПолеЗаполнено(НастройкиAPI, "Логин")
		И ПолеЗаполнено(НастройкиAPI, "Пароль");

КонецФункции

Функция ЗагрузитьСвязки(Источник, НастройкиAPI) Экспорт

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Возврат Ложь;
	КонецЕсли;

	АдресЗапроса = эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI) + "/v5/references/goods_links?names=false";
	КодыУспеха = Новый Массив;
	КодыУспеха.Добавить(200);
	РезультатHTTP = ВыполнитьЗапросСТокеном(Источник, НастройкиAPI, "GET", АдресЗапроса, Неопределено, "goodsLinks", КодыУспеха);
	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;

	Если ТипЗнч(РезультатHTTP.Json) <> Тип("Массив") Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Ошибка, , Источник,
			"Ответ goods_links не является массивом");
		Возврат Ложь;
	КонецЕсли;

	ЗаписатьСвязки(РезультатHTTP.Json);
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьЗапросСТокеном(Источник, НастройкиAPI, Метод, Адрес, Тело, Контур, КодыУспеха, ЗаказПокупателя = Неопределено)

	Если Не ОбеспечитьТокен(Источник, НастройкиAPI, Ложь) Тогда
		Результат = Новый Структура("Успех, КодСостояния, Json, ТекстОтвета, ТекстОшибки", Ложь, 0, Неопределено, "", "Не получен токен АСНА");
		Возврат Результат;
	КонецЕсли;

	Результат = ВызватьМетодАСНА(Источник, НастройкиAPI, Метод, Адрес, Тело, Контур, КодыУспеха, ЗаказПокупателя);
	Если Результат.КодСостояния = 401 И ОбеспечитьТокен(Источник, НастройкиAPI, Истина) Тогда
		Результат = ВызватьМетодАСНА(Источник, НастройкиAPI, Метод, Адрес, Тело, Контур, КодыУспеха, ЗаказПокупателя);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ВызватьМетодАСНА(Источник, НастройкиAPI, Метод, Адрес, Тело, Контур, КодыУспеха, ЗаказПокупателя)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "Bearer " + НастройкиAPI.auth_token);

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИсточникЗаказов", Источник);
	ПараметрыЗапроса.Вставить("Метод", Метод);
	ПараметрыЗапроса.Вставить("Адрес", Адрес);
	ПараметрыЗапроса.Вставить("Контур", Контур);
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("КодыУспеха", КодыУспеха);
	Если Тело <> Неопределено Тогда
		ПараметрыЗапроса.Вставить("Тело", Тело);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		ПараметрыЗапроса.Вставить("ЗаказПокупателя", ЗаказПокупателя);
	КонецЕсли;

	Возврат эв_ОбменСПорталамиСервер.ВыполнитьЗапросHTTP(ПараметрыЗапроса);

КонецФункции

Функция ОбеспечитьТокен(Источник, НастройкиAPI, Принудительно)

	Если Не Принудительно И ЗначениеЗаполнено(НастройкиAPI.auth_token) Тогда
		Возврат Истина;
	КонецЕсли;

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	ТелоФормы = "client_id=" + КодироватьСтроку(НастройкиAPI.Логин, СпособКодированияСтроки.КодировкаURL)
		+ "&client_secret=" + КодироватьСтроку(НастройкиAPI.Пароль, СпособКодированияСтроки.КодировкаURL)
		+ "&grant_type=client_credentials";

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИсточникЗаказов", Источник);
	ПараметрыЗапроса.Вставить("Метод", "POST");
	ПараметрыЗапроса.Вставить("Адрес", "https://sso.asna.cloud:5000/connect/token");
	ПараметрыЗапроса.Вставить("Контур", "token");
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("Данные", ТелоФормы);
	ПараметрыЗапроса.Вставить("ПарольДляМаскировки", НастройкиAPI.Пароль);

	РезультатHTTP = эв_ОбменСПорталамиСервер.ВыполнитьЗапросHTTP(ПараметрыЗапроса);
	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;

	Токен = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(РезультатHTTP.Json, "access_token")));
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Ошибка, , Источник,
			"В ответе SSO нет access_token");
		Возврат Ложь;
	КонецЕсли;

	СохранитьТокен(Источник, Токен);
	НастройкиAPI.auth_token = Токен;
	Возврат Истина;

КонецФункции

Процедура СохранитьТокен(Источник, Токен)

	МенеджерЗаписи = РегистрыСведений.эв_НастройкиAPIИсточникаЗаказов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИсточникЗаказов = Источник;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;

	МенеджерЗаписи.auth_token = Токен;
	МенеджерЗаписи.merchant = Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-ddTHH:mm:ss");
	МенеджерЗаписи.Записать();

КонецПроцедуры

Функция АдресРесурсаМагазина(НастройкиAPI, Хвост)

	Возврат эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI)
		+ "/v5/stores/"
		+ КодироватьСтроку(СокрЛП(НастройкиAPI.Логин), СпособКодированияСтроки.КодировкаURL)
		+ Хвост;

КонецФункции

Функция ДатаДляОстатков()

	Возврат Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-ddTHH:mm:ss") + "+00:00";

КонецФункции

Функция ДатаJSONСоСмещением(ДатаЗначение)

	ТекстДаты = ЗаписатьДатуJSON(ДатаЗначение, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Возврат СтрЗаменить(ТекстДаты, """", "");

КонецФункции

Функция ДатаSince(ДатаГраницы)

	Возврат СтрЗаменить(ДатаJSONСоСмещением(ДатаГраницы), "+", "%2B");

КонецФункции

Процедура ЗаписатьСвязки(МассивСвязок)

	УникальныеСвязки = Новый Соответствие;
	Для Каждого ЭлементСвязки Из МассивСвязок Цикл

		КодАСНА = ЧислоИзJSON(ЗначениеПоляJSON(ЭлементСвязки, "nnt"));
		Если КодАСНА = 0 Тогда
			Продолжить;
		КонецЕсли;

		Номенклатура = эв_ОбменСПорталамиСервер.НоменклатураПоИдентификаторуПортала(ЗначениеПоляJSON(ЭлементСвязки, "sku"));
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		УникальныеСвязки.Вставить(Номенклатура, Формат(КодАСНА, "ЧГ="));

	КонецЦикла;

	Набор = РегистрыСведений.эв_КодыНоменклатурыПорталов.СоздатьНаборЗаписей();
	Набор.Отбор.ВидИсточника.Установить(Перечисления.эв_ВидыИсточниковЗаказа.Асна);
	Для Каждого ЭлементСвязки Из УникальныеСвязки Цикл
		Запись = Набор.Добавить();
		Запись.ВидИсточника = Перечисления.эв_ВидыИсточниковЗаказа.Асна;
		Запись.Номенклатура = ЭлементСвязки.Ключ;
		Запись.КодПортала = ЭлементСвязки.Значение;
	КонецЦикла;
	Набор.Записать();

КонецПроцедуры

Функция СвязкиЗаполнены()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Связки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.эв_КодыНоменклатурыПорталов КАК Связки
		|ГДЕ
		|	Связки.ВидИсточника = ЗНАЧЕНИЕ(Перечисление.эв_ВидыИсточниковЗаказа.Асна)";

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция ПолучитьОстаткиЦены(Источник, НастройкиAPI, ПолнаяВыгрузка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Связки.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Связки.КодПортала) КАК КодАСНА
		|ПОМЕСТИТЬ ВТ_Связки
		|ИЗ
		|	РегистрСведений.эв_КодыНоменклатурыПорталов КАК Связки
		|ГДЕ
		|	Связки.ВидИсточника = ЗНАЧЕНИЕ(Перечисление.эв_ВидыИсточниковЗаказа.Асна)
		|
		|СГРУППИРОВАТЬ ПО
		|	Связки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика,
		|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Склад
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(, СтруктурнаяЕдиница = &Склад) КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Резервы.Номенклатура КАК Номенклатура,
		|	Резервы.Характеристика КАК Характеристика,
		|	СУММА(Резервы.КоличествоОстаток) КАК РезервОстаток
		|ПОМЕСТИТЬ ВТ_Резервы
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &Склад
		|				И ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК Резервы
		|
		|СГРУППИРОВАТЬ ПО
		|	Резервы.Номенклатура,
		|	Резервы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Склад.Номенклатура КАК Номенклатура,
		|	ВТ_Склад.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0)
		|	КОНЕЦ КАК ДоступныйОстаток,
		|	ЕСТЬNULL(ВТ_Склад.Номенклатура.ЦеноваяГруппа.Наименование, """") КАК ЦеноваяГруппаНаименование,
		|	ЕСТЬNULL(ВТ_Склад.Номенклатура.ор_ЖНВЛС, ЛОЖЬ) КАК ЖНВЛС,
		|	ВТ_Склад.Характеристика.ор_СрокГодности КАК СрокГодности,
		|	ВТ_Связки.КодАСНА КАК КодАСНА
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	ВТ_Склад КАК ВТ_Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Резервы КАК ВТ_Резервы
		|		ПО ВТ_Склад.Номенклатура = ВТ_Резервы.Номенклатура
		|			И ВТ_Склад.Характеристика = ВТ_Резервы.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Связки КАК ВТ_Связки
		|		ПО ВТ_Склад.Номенклатура = ВТ_Связки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	Цены.Характеристика КАК Характеристика,
		|	МАКСИМУМ(Цены.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦен = &ВидЦен) КАК Цены
		|
		|СГРУППИРОВАТЬ ПО
		|	Цены.Номенклатура,
		|	Цены.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура КАК Номенклатура,
		|	ВТ_Остатки.Характеристика КАК Характеристика,
		|	ВТ_Остатки.ДоступныйОстаток КАК ДоступныйОстаток,
		|	ВТ_Остатки.ЖНВЛС КАК ЖНВЛС,
		|	ВТ_Остатки.СрокГодности КАК СрокГодности,
		|	ВТ_Остатки.КодАСНА КАК КодАСНА,
		|	ВЫБОР
		|		КОГДА ВРЕГ(ВТ_Остатки.ЦеноваяГруппаНаименование) = ""ЭВАЛАР""
		|			ТОГДА ЕСТЬNULL(ЦеныБезХарактеристики.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(ЦеныСХарактеристикой.Цена, 0)
		|	КОНЕЦ КАК Цена
		|ПОМЕСТИТЬ ВТ_Текущие
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ЦеныБезХарактеристики
		|		ПО ВТ_Остатки.Номенклатура = ЦеныБезХарактеристики.Номенклатура
		|			И (ЦеныБезХарактеристики.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|			И (ВРЕГ(ВТ_Остатки.ЦеноваяГруппаНаименование) = ""ЭВАЛАР"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ЦеныСХарактеристикой
		|		ПО ВТ_Остатки.Номенклатура = ЦеныСХарактеристикой.Номенклатура
		|			И ВТ_Остатки.Характеристика = ЦеныСХарактеристикой.Характеристика
		|			И (ВРЕГ(ВТ_Остатки.ЦеноваяГруппаНаименование) <> ""ЭВАЛАР"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Снимок.Номенклатура КАК Номенклатура,
		|	Снимок.Характеристика КАК Характеристика,
		|	Снимок.Цена КАК Цена,
		|	Снимок.ДоступныйОстаток КАК ДоступныйОстаток,
		|	ЕСТЬNULL(Снимок.Номенклатура.ор_ЖНВЛС, ЛОЖЬ) КАК ЖНВЛС,
		|	Снимок.Характеристика.ор_СрокГодности КАК СрокГодности,
		|	ВТ_Связки.КодАСНА КАК КодАСНА
		|ПОМЕСТИТЬ ВТ_Снимок
		|ИЗ
		|	РегистрСведений.эв_ВыгруженныеОстаткиПорталов КАК Снимок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Связки КАК ВТ_Связки
		|		ПО Снимок.Номенклатура = ВТ_Связки.Номенклатура
		|ГДЕ
		|	Снимок.ИсточникЗаказов = &Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_Текущие.Номенклатура, ВТ_Снимок.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_Текущие.Характеристика, ВТ_Снимок.Характеристика) КАК Характеристика,
		|	ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) КАК ДоступныйОстаток,
		|	ЕСТЬNULL(ВТ_Текущие.Цена, ВТ_Снимок.Цена) КАК Цена,
		|	ЕСТЬNULL(ВТ_Текущие.ЖНВЛС, ВТ_Снимок.ЖНВЛС) КАК ЖНВЛС,
		|	ЕСТЬNULL(ВТ_Текущие.СрокГодности, ВТ_Снимок.СрокГодности) КАК СрокГодности,
		|	ЕСТЬNULL(ВТ_Текущие.КодАСНА, ВТ_Снимок.КодАСНА) КАК КодАСНА
		|ИЗ
		|	ВТ_Текущие КАК ВТ_Текущие
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Снимок КАК ВТ_Снимок
		|		ПО ВТ_Текущие.Номенклатура = ВТ_Снимок.Номенклатура
		|			И ВТ_Текущие.Характеристика = ВТ_Снимок.Характеристика
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ПолнаяВыгрузка
		|				ТОГДА ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) >= 1
		|			КОГДА ВТ_Снимок.Номенклатура ЕСТЬ NULL
		|				ТОГДА ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) >= 1
		|			ИНАЧЕ ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) <> ЕСТЬNULL(ВТ_Снимок.ДоступныйОстаток, 0)
		|		КОНЕЦ";

	Запрос.УстановитьПараметр("Склад", НастройкиAPI.Склад);
	Запрос.УстановитьПараметр("ВидЦен", НастройкиAPI.ВидЦен);
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ПолнаяВыгрузка", ПолнаяВыгрузка);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция СформироватьМассивОстатков(ТаблицаОстатков, ТаблицаКОтправке)

	МассивОстатков = Новый Массив;
	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл

		КодАСНА = ЧислоИзJSON(СтрокаОстатка.КодАСНА);
		Если КодАСНА = 0 Или Не ЗначениеЗаполнено(СтрокаОстатка.Цена) Тогда
			Продолжить;
		КонецЕсли;
		Если Цел(СтрокаОстатка.Цена) = 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаКОтправке = ТаблицаКОтправке.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКОтправке, СтрокаОстатка);
		Если Цел(СтрокаОстатка.ДоступныйОстаток) <= 0 Тогда
			СтрокаКОтправке.ДоступныйОстаток = 0;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаОстатка.Характеристика) Тогда
			ИдентификаторПартии = XMLСтрока(СтрокаОстатка.Характеристика);
		Иначе
			ИдентификаторПартии = XMLСтрока(СтрокаОстатка.Номенклатура);
		КонецЕсли;

		ЦенаЦелая = Цел(СтрокаОстатка.Цена);
		Позиция = Новый Структура;
		Позиция.Вставить("prtId", ИдентификаторПартии);
		Позиция.Вставить("nnt", КодАСНА);
		Позиция.Вставить("sku", XMLСтрока(СтрокаОстатка.Номенклатура));
		Позиция.Вставить("qnt", Цел(СтрокаОстатка.ДоступныйОстаток));
		Позиция.Вставить("gnvls", СтрокаОстатка.ЖНВЛС = Истина);
		Позиция.Вставить("prcOptNds", ЦенаЦелая);
		Позиция.Вставить("prcRet", ЦенаЦелая);
		Позиция.Вставить("prcGnvlsMax", ЦенаЦелая);
		Если ЗначениеЗаполнено(СтрокаОстатка.СрокГодности) Тогда
			Позиция.Вставить("exp", Формат(СтрокаОстатка.СрокГодности, "ДФ=yyyy-MM-dd") + "T00:00:00+00:00");
		КонецЕсли;

		МассивОстатков.Добавить(Позиция);

	КонецЦикла;

	Возврат МассивОстатков;

КонецФункции

Процедура ЗагрузитьЗаказыИзJSON(Источник, НастройкиAPI, ДанныеJSON, ТекстОтвета, ТаблицаЗагруженных)

	ЗаголовкиЗаказов = ЗначениеПоляJSON(ДанныеJSON, "headers");
	Если ТипЗнч(ЗаголовкиЗаказов) <> Тип("Массив") Или ЗаголовкиЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СтрокиЗаказов = ЗначениеПоляJSON(ДанныеJSON, "rows");
	СтатусыЗаказов = ЗначениеПоляJSON(ДанныеJSON, "statuses");
	СтатусНовый = эв_ОбменСПорталамиСервер.СостояниеНовыйЗаказа(НастройкиAPI.Вид);

	Для Каждого ШапкаЗаказа Из ЗаголовкиЗаказов Цикл

		ИдентификаторЗаказа = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ШапкаЗаказа, "orderId")));
		НомерНаСайте = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ШапкаЗаказа, "num")));
		Если Не ЗначениеЗаполнено(НомерНаСайте) Тогда
			Продолжить;
		КонецЕсли;

		СтатусЗаказа = СтатусЗаказаПоИдентификатору(СтатусыЗаказов, ИдентификаторЗаказа);
		СуществующийЗаказ = эв_ОбменСПорталамиСервер.НайтиЗаказПоНомеруНаСайте(НомерНаСайте, Источник);
		Если ЗначениеЗаполнено(СуществующийЗаказ) Тогда
			Если СтатусЗаказа.Код = 111 Тогда
				Попытка
					эв_ОбменСПорталамиСервер.ОтменитьЗаказПортала(СуществующийЗаказ, Источник);
				Исключение
					ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Ошибка, , Источник,
						СтрШаблон("Ошибка отмены заказа %1: %2", НомерНаСайте, ОписаниеОшибки()));
				КонецПопытки;
			КонецЕсли;
			ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, СуществующийЗаказ, НомерНаСайте, Ложь);
			Продолжить;
		КонецЕсли;

		Если СтатусЗаказа.Код = 111 Тогда
			Продолжить;
		КонецЕсли;

		ДанныеЗаказа = РазобратьЗаказ(ШапкаЗаказа, СтатусЗаказа, СтрокиЗаказов, ИдентификаторЗаказа, НомерНаСайте, ТекстОтвета);
		Если ДанныеЗаказа.Товары.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Предупреждение, , Источник,
				СтрШаблон("Заказ %1 не создан: нет строк с номенклатурой по связке nnt", НомерНаСайте));
			Продолжить;
		КонецЕсли;

		Попытка
			ЗаказСсылка = эв_ОбменСПорталамиСервер.СоздатьЗаказПортала(Источник, НастройкиAPI, ДанныеЗаказа);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен с порталами.АСНА", УровеньЖурналаРегистрации.Ошибка, , Источник,
				СтрШаблон("Ошибка создания заказа %1: %2", НомерНаСайте, ОписаниеОшибки()));
			Продолжить;
		КонецПопытки;

		Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
			Продолжить;
		КонецЕсли;

		ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, ЗаказСсылка, НомерНаСайте, Истина);
		Если ЗначениеЗаполнено(СтатусНовый) Тогда
			эв_ОбменСПорталамиСервер.ПоставитьЗаказВОчередьСтатусов(ЗаказСсылка, Источник, СтатусНовый, , Истина);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция РазобратьЗаказ(ШапкаЗаказа, СтатусЗаказа, СтрокиЗаказов, ИдентификаторЗаказа, НомерНаСайте, ТекстОтвета)

	ФИО = РазобратьФИО(СтрокаИзJSON(ЗначениеПоляJSON(ШапкаЗаказа, "name")));

	ДанныеЗаказа = Новый Структура;
	ДанныеЗаказа.Вставить("НомерНаСайте", НомерНаСайте);
	ДанныеЗаказа.Вставить("ИдентификаторНаПортале", ИдентификаторЗаказа);
	ДанныеЗаказа.Вставить("Дата", ДатаИзJSON(ЗначениеПоляJSON(ШапкаЗаказа, "date")));
	ДанныеЗаказа.Вставить("Фамилия", ФИО.Фамилия);
	ДанныеЗаказа.Вставить("Имя", ФИО.Имя);
	ДанныеЗаказа.Вставить("Отчество", ФИО.Отчество);
	ДанныеЗаказа.Вставить("Почта", "");
	ДанныеЗаказа.Вставить("Телефон", ПривестиТелефон(СтрокаИзJSON(ЗначениеПоляJSON(ШапкаЗаказа, "mPhone"))));
	ДанныеЗаказа.Вставить("Комментарий", СтатусЗаказа.Комментарий);
	ДанныеЗаказа.Вставить("ИсходныйПакетJSON", ТекстОтвета);
	ДанныеЗаказа.Вставить("Товары", Новый Массив);

	Если ТипЗнч(СтрокиЗаказов) <> Тип("Массив") Тогда
		Возврат ДанныеЗаказа;
	КонецЕсли;

	Для Каждого СтрокаПортала Из СтрокиЗаказов Цикл
		Если СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(СтрокаПортала, "orderId"))) <> ИдентификаторЗаказа Тогда
			Продолжить;
		КонецЕсли;

		Номенклатура = НоменклатураПоКодуАСНА(ЧислоИзJSON(ЗначениеПоляJSON(СтрокаПортала, "nnt")));
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТовара = Новый Структура;
		СтрокаТовара.Вставить("ИдПозиции", СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(СтрокаПортала, "rowId"))));
		СтрокаТовара.Вставить("Номенклатура", Номенклатура);
		СтрокаТовара.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		СтрокаТовара.Вставить("Количество", ЧислоИзJSON(ЗначениеПоляJSON(СтрокаПортала, "qnt")));
		СтрокаТовара.Вставить("Цена", ЧислоИзJSON(ЗначениеПоляJSON(СтрокаПортала, "prc")));
		ДанныеЗаказа.Товары.Добавить(СтрокаТовара);
	КонецЦикла;

	Возврат ДанныеЗаказа;

КонецФункции

Функция СтатусЗаказаПоИдентификатору(СтатусыЗаказов, ИдентификаторЗаказа)

	Результат = Новый Структура("Код, Комментарий", 0, "");
	Если ТипЗнч(СтатусыЗаказов) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого СтатусЗаказа Из СтатусыЗаказов Цикл
		Если СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(СтатусЗаказа, "orderId"))) <> ИдентификаторЗаказа Тогда
			Продолжить;
		КонецЕсли;
		Результат.Код = ЧислоИзJSON(ЗначениеПоляJSON(СтатусЗаказа, "status"));
		Результат.Комментарий = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(СтатусЗаказа, "cmnt")));
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция НоменклатураПоКодуАСНА(КодАСНА)

	Если КодАСНА = 0 Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Связки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.эв_КодыНоменклатурыПорталов КАК Связки
		|ГДЕ
		|	Связки.ВидИсточника = ЗНАЧЕНИЕ(Перечисление.эв_ВидыИсточниковЗаказа.Асна)
		|	И Связки.КодПортала = &КодПортала";
	Запрос.УстановитьПараметр("КодПортала", Формат(КодАСНА, "ЧГ="));

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;
	КонецЕсли;

	Возврат Справочники.Номенклатура.ПустаяСсылка();

КонецФункции

Функция СтрокиЧастичнойСборки(ЗаказПокупателя, ИдентификаторЗаказа)

	СтрокиСборки = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыСайта.эв_ИсходныйПакет КАК ИсходныйПакет
		|ИЗ
		|	РегистрСведений.ЗаказыПокупателейССайта КАК ЗаказыСайта
		|ГДЕ
		|	ЗаказыСайта.ЗаказПокупателя = &ЗаказПокупателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.эв_ИдентификаторПозицииПортала КАК ИдПозиции,
		|	Запасы.Количество КАК Количество
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Ссылка = &ЗаказПокупателя
		|	И Запасы.эв_ИдентификаторПозицииПортала <> """"";
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);

	Результаты = Запрос.ВыполнитьПакет();
	ВыборкаПакета = Результаты[0].Выбрать();
	Если Не ВыборкаПакета.Следующий() Или ВыборкаПакета.ИсходныйПакет = Неопределено Тогда
		Возврат СтрокиСборки;
	КонецЕсли;

	ТекстПакета = ВыборкаПакета.ИсходныйПакет.Получить();
	Если ТипЗнч(ТекстПакета) <> Тип("Строка") Или Не ЗначениеЗаполнено(ТекстПакета) Тогда
		Возврат СтрокиСборки;
	КонецЕсли;

	Попытка
		ПакетJSON = КоннекторHTTP.JsonВОбъект(ТекстПакета);
	Исключение
		Возврат СтрокиСборки;
	КонецПопытки;

	СтрокиПортала = ЗначениеПоляJSON(ПакетJSON, "rows");
	Если ТипЗнч(СтрокиПортала) <> Тип("Массив") Тогда
		Возврат СтрокиСборки;
	КонецЕсли;

	КоличествоПоПозициям = Новый Соответствие;
	ВыборкаСтрок = Результаты[1].Выбрать();
	Пока ВыборкаСтрок.Следующий() Цикл
		КоличествоПоПозициям.Вставить(СокрЛП(ВыборкаСтрок.ИдПозиции), ВыборкаСтрок.Количество);
	КонецЦикла;

	Для Каждого СтрокаПортала Из СтрокиПортала Цикл
		Если СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(СтрокаПортала, "orderId"))) <> ИдентификаторЗаказа Тогда
			Продолжить;
		КонецЕсли;

		ИдПозиции = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(СтрокаПортала, "rowId")));
		КоличествоПортала = ЧислоИзJSON(ЗначениеПоляJSON(СтрокаПортала, "qnt"));
		КоличествоФакт = КоличествоПоПозициям.Получить(ИдПозиции);
		Если КоличествоФакт = Неопределено Тогда
			КоличествоФакт = 0;
		КонецЕсли;
		Если КоличествоФакт = КоличествоПортала Тогда
			Продолжить;
		КонецЕсли;

		СтрокаСборки = Новый Структура;
		СтрокаСборки.Вставить("rowId", ИдПозиции);
		СтрокаСборки.Вставить("qntUnrsv", КоличествоФакт);
		СтрокиСборки.Добавить(СтрокаСборки);
	КонецЦикла;

	Возврат СтрокиСборки;

КонецФункции

Функция РазобратьФИО(ПолноеИмя)

	Результат = Новый Структура("Имя, Фамилия, Отчество", "", "", "");
	ЧастиИмени = СтрРазделить(СокрЛП(ПолноеИмя), " ", Ложь);
	Если ЧастиИмени.Количество() > 0 Тогда
		Результат.Имя = ЧастиИмени[0];
	КонецЕсли;
	Если ЧастиИмени.Количество() > 1 Тогда
		Результат.Фамилия = ЧастиИмени[1];
	КонецЕсли;
	Если ЧастиИмени.Количество() > 2 Тогда
		ОтчествоЧасти = Новый Массив;
		Для Индекс = 2 По ЧастиИмени.Количество() - 1 Цикл
			ОтчествоЧасти.Добавить(ЧастиИмени[Индекс]);
		КонецЦикла;
		Результат.Отчество = СтрСоединить(ОтчествоЧасти, " ");
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ПривестиТелефон(Телефон)

	Цифры = "";
	Для НомерСимвола = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, НомерСимвола, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
		КонецЕсли;
	КонецЦикла;

	Если СтрДлина(Цифры) = 11 И Лев(Цифры, 1) = "8" Тогда
		Цифры = "7" + Сред(Цифры, 2);
	ИначеЕсли СтрДлина(Цифры) = 10 Тогда
		Цифры = "7" + Цифры;
	КонецЕсли;

	Возврат Цифры;

КонецФункции

Функция НоваяТаблицаЗагруженныхЗаказов()

	ТаблицаЗагруженных = Новый ТаблицаЗначений;
	ТаблицаЗагруженных.Колонки.Добавить("ЗаказПокупателя", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТаблицаЗагруженных.Колонки.Добавить("НомерЗаказаНаСайте", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаЗагруженных.Колонки.Добавить("ЭтоНовый", Новый ОписаниеТипов("Булево"));
	Возврат ТаблицаЗагруженных;

КонецФункции

Процедура ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, ЗаказПокупателя, НомерНаСайте, ЭтоНовый)

	СтрокаТаблицы = ТаблицаЗагруженных.Добавить();
	СтрокаТаблицы.ЗаказПокупателя = ЗаказПокупателя;
	СтрокаТаблицы.НомерЗаказаНаСайте = НомерНаСайте;
	СтрокаТаблицы.ЭтоНовый = ЭтоНовый;

КонецПроцедуры

Функция ПолеЗаполнено(НастройкиAPI, ИмяПоля)

	ЗначениеПоля = Неопределено;
	Если Не НастройкиAPI.Свойство(ИмяПоля, ЗначениеПоля) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ЗначениеЗаполнено(ЗначениеПоля);

КонецФункции

Функция ЗначениеПоляJSON(ОбъектJSON, ИмяПоля)

	Если ТипЗнч(ОбъектJSON) = Тип("Соответствие") Тогда
		Возврат ОбъектJSON.Получить(ИмяПоля);
	ИначеЕсли ТипЗнч(ОбъектJSON) = Тип("Структура") Тогда
		ЗначениеПоля = Неопределено;
		ОбъектJSON.Свойство(ИмяПоля, ЗначениеПоля);
		Возврат ЗначениеПоля;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция СтрокаИзJSON(ЗначениеПоля)

	Если ЗначениеПоля = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат СокрЛП(Строка(ЗначениеПоля));

КонецФункции

Функция ЧислоИзJSON(ЗначениеПоля)

	Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
		Возврат 0;
	КонецЕсли;
	Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;
	Попытка
		Возврат Число(ЗначениеПоля);
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

Функция ДатаИзJSON(ЗначениеПоля)

	Если ТипЗнч(ЗначениеПоля) = Тип("Дата") Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	Попытка
		Возврат ПрочитатьДатуJSON(Строка(ЗначениеПоля), ФорматДатыJSON.ISO);
	Исключение
		Возврат ТекущаяДатаСеанса();
	КонецПопытки;

КонецФункции

#КонецОбласти
